[
  {
    "front": {
      "type": "text",
      "content": "On dual carriageways (autopistas/autovías) with 2 lanes in each direction, where should cars and vehicles >3.5t drive?"
    },
    "back": {
      "type": "text",
      "content": "• In the right lane\n• This applies both inside and outside urban areas"
    }
  },
  {
    "front": {
      "type": "text",
      "content": "On dual carriageways (autopistas/autovías) with 3 lanes in each direction, where should cars and vehicles >3.5t drive?"
    },
    "back": {
      "type": "text",
      "content": "• In the right lane\n• Central lane for overtaking or turning left\n• Never in the left lane\n• Applies both inside and outside urban areas"
    }
  },
  {
    "front": {
      "type": "text",
      "content": "On conventional highways outside urban areas with more than one lane in the same direction, where should cars drive?"
    },
    "back": {
      "type": "text",
      "content": "• In the right lane\n• Other lanes can be used when necessary"
    }
  },
  {
    "front": {
      "type": "text",
      "content": "On conventional highways outside urban areas with 3+ lanes, where should lorries, minivans, and special vehicles >3.5t drive?"
    },
    "back": {
      "type": "text",
      "content": "• In the right lane\n• Adjacent lane allowed exceptionally\n• Never use remaining lanes\n• Change lanes only when traffic requires"
    }
  },
  {
    "front": {
      "type": "text",
      "content": "How should you drive around refuge islands or guidance devices on two-way streets?"
    },
    "back": {
      "type": "text",
      "content": "• Drive on the right side of these elements\n• Leave them to your left\n• This applies when they separate opposite directions of traffic"
    }
  },
  {
    "front": {
      "type": "text",
      "content": "How can you drive around refuge islands or guidance devices on one-way streets or within a single direction of travel?"
    },
    "back": {
      "type": "text",
      "content": "• Driving is permitted on both the left and right sides of these elements\n• This applies specifically to one-way streets or within the corresponding part of a single direction of travel"
    }
  },
  {
    "front": {
      "type": "text",
      "content": "What are the rules for vehicles using the hard shoulder in Spain regarding driving in parallel and overtaking?"
    },
    "back": {
      "type": "text",
      "content": "• Driving in parallel on the hard shoulder is forbidden, except for bicycles and mopeds\n• Overtaking on the hard shoulder is forbidden if it takes more than 15 seconds, except for bicycles"
    }
  },
  {
    "front": {
      "type": "text",
      "content": "What are the rules for maintaining stopping gaps in Spain?"
    },
    "back": {
      "type": "text",
      "content": "• Maintain a gap large enough to allow for emergency braking\n• Leave enough space to allow other vehicles to overtake\n• Vehicles over 3.5 tonnes and longer than 10 meters must maintain a gap of at least 50 meters from the vehicle in front (outside urban areas)"
    }
  },
  {
    "front": {
      "type": "text",
      "content": "What is the required safety distance in tunnels when not overtaking in Spain?"
    },
    "back": {
      "type": "text",
      "content": "• Maintain a safety distance of at least 100 meters or 4 seconds from the vehicle in front"
    }
  },
  {
    "front": {
      "type": "text",
      "content": "What are the general priority rules at junctions in Spain?"
    },
    "back": {
      "type": "text",
      "content": "• Priority is determined by traffic signs\n• If no signs, vehicles approaching from the right have right of way\n• Exceptions (vehicles that have priority):\n  - Those on a main road over those on a secondary road\n  - Those already in a roundabout over those entering\n  - Those on motorways/dual carriageways over those joining\n  - Those on a public road over those joining from a private road\n• Do not enter a junction if your vehicle might obstruct other traffic"
    }
  },
  {
    "front": {
      "type": "text",
      "content": "What are the priority rules regarding cyclists in Spain?"
    },
    "back": {
      "type": "text",
      "content": "Motor vehicle drivers must give way to cyclists:\n• When cyclists are crossing a properly signaled cycle lane, cycle path, or